In [1]:
import pandas as pd
import numpy as np
data3 = pd.read_csv("..//raw//DFF.csv",header=None) #relative path represented as ..
data3.columns=['Date3','DFF']
print(data3.columns)

Index(['Date3', 'DFF'], dtype='object')

In [2]:
data3=data3.drop(index=[0])
data3

            Date3   DFF
1      1954-07-01  1.13
2      1954-07-02  1.25
3      1954-07-03  1.25
4      1954-07-04  1.25
5      1954-07-05  0.88
...           ...   ...
25736  2024-12-15  4.58
25737  2024-12-16  4.58
25738  2024-12-17  4.58
25739  2024-12-18  4.58
25740  2024-12-19  4.33

[25740 rows x 2 columns]

In [3]:
data3['Date3'] = pd.to_datetime(data3['Date3'], format='%Y-%m-%d',errors='coerce')
data3['DFF']=pd.to_numeric(data3['DFF'],errors='coerce') 
data3=data3.dropna(subset=['Date3'])  #drop rows with invalid data
data3

           Date3   DFF
1     1954-07-01  1.13
2     1954-07-02  1.25
3     1954-07-03  1.25
4     1954-07-04  1.25
5     1954-07-05  0.88
...          ...   ...
25736 2024-12-15  4.58
25737 2024-12-16  4.58
25738 2024-12-17  4.58
25739 2024-12-18  4.58
25740 2024-12-19  4.33

[25740 rows x 2 columns]

In [4]:
data3.set_index('Date3',inplace=True) 
quarterly3=data3.resample('QE').mean() 
quarterly3.reset_index(inplace=True)  
print(quarterly3)

         Date3       DFF
0   1954-09-30  1.028478
1   1954-12-31  0.988370
2   1955-03-31  1.345000
3   1955-06-30  1.501099
4   1955-09-30  1.936522
..         ...       ...
277 2023-12-31  5.330000
278 2024-03-31  5.330000
279 2024-06-30  5.330000
280 2024-09-30  5.264783
281 2024-12-31  4.695625

[282 rows x 2 columns]

In [5]:
quarterly3.to_csv("DFF_quarterly.csv", index=False)

In [6]:
quarterly3

         Date3       DFF
0   1954-09-30  1.028478
1   1954-12-31  0.988370
2   1955-03-31  1.345000
3   1955-06-30  1.501099
4   1955-09-30  1.936522
..         ...       ...
277 2023-12-31  5.330000
278 2024-03-31  5.330000
279 2024-06-30  5.330000
280 2024-09-30  5.264783
281 2024-12-31  4.695625

[282 rows x 2 columns]